
**** Lists 
     #+BEGIN_SRC emacs-lisp 
     ;;; books
       (setq listsdir "/media/paulo/HDD_1/syncthing/org/lists.org") 
       (add-to-list 'org-capture-templates
		    '("b" "Books to read" entry
		      (file+olp listsdir "Capture" "Books") 
		      "* %^{Book title} %?\n Added: %t\n:INFO:\n:AUTHOR: %^{Author}\n:END:" :empty-lines 1))

		      ;;; articles
       (add-to-list 'org-capture-templates
		    '("A" "Articles to read" entry
		      (file+olp listsdir "Capture" "Artigos") 
		      "* %^{Article title} %?\n Added: %t\n:INFO:\n:AUTHOR: %^{Author}\n:LINK: %^{Link}\n:END:" :empty-lines 1))

		
		      ;;; movies
       (add-to-list 'org-capture-templates
		    '("m" "Movies/series to watch" entry
		      (file+olp listsdir "Capture" "Movies/series") 
		      "* %^{Movie title} %^{Kind of media|:movie:|:series:|:animu:} %?\n Added: %t" :empty-lines 1))

		      ;;; games
       (add-to-list 'org-capture-templates
		    '("g" "Games to play" entry
		      (file+olp listsdir "Capture" "Games") 
		      "* %^{Game title} %?\n Added: %t" :empty-lines 1))
     #+END_SRC 

     #+RESULTS:
     | s | Statistical refs | entry | (file+olp listsdir Capture Stats) | * %^{TITLE} |
**** Writing 
     #+BEGIN_SRC emacs-lisp 
       ;;; creative/productive writing
       (setq writedir "/media/paulo/HDD_1/syncthing/org/writing.org")
       (add-to-list 'org-capture-templates
		       '("e" "creative/productive writing" entry
			 (file+headline writedir "Capture") 
			 "* %t - %^{Title}\nnote taken on %T\n %?"
			 :empty-lines 1 :jump-to-captured t))

       (setq tccdir "/media/paulo/HDD_1/syncthing/org/tcc.org")
       (add-to-list 'org-capture-templates
		       '("T" "Trabalho de conclusão de curso" entry
			 (file+headline tccdir "Trabalho de Conclusão de Curso") 
			 "* %t - %^{Title}\nnote taken on %T\n %?"
			 :empty-lines 1 :jump-to-captured t))

			 ;;; journaling
	 (setq journaldir "/media/paulo/HDD_1/syncthing/org/journaling.org")
	  (add-to-list 'org-capture-templates
		       '("j" "Journal entry" entry
			 (file+headline journaldir "Capture") 
			 "* %t - %^{Title}\n:LOGBOOK:\n%?:END:"
			 :empty-lines 1 :jump-to-captured t))


       (setq blogpostsdir "/media/paulo/HDD_CREATIVE_FILES/src/blog/posts/new.html")
       (add-to-list 'org-capture-templates
		    '("p" "Novo post" plain 
		      (file blogpostsdir)
		      "{% extendds \"base.html\" %}\n{% block title %} %^{TITLE} {% endblock %}\n{% block content %}\n {% filter markdown %}\n%?\n{% endfilter %}\n{% endblock %}\n"
		      :empty-lines 1 :jump-to-captured t))
		      
		  
     #+END_SRC


     #+RESULTS:
     | T | Trabalho de conclusão de curso | entry | (file+headline tccdir Trabalho de Conclusão de Curso) | * %t - %^{Title} |

* Mode hooks
#+BEGIN_SRC emacs-lisp

  (add-hook 'dired-mode-hook 'dired-hide-details-mode)

 (add-hook 'magit-mode-hook
       (lambda ()
        (local-set-key (kbd "M-a") 'magit-remote-add)))

  (defun my-python-hooks ()
    (hl-line-mode 1)
    (jedi:setup))

  (add-hook 'python-mode-hook 'my-python-hooks) 

  (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
  (add-hook 'emacs-lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'ielm-mode-hook #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)

  (require 'web-mode)
     (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
     (add-hook 'web-mode-hook (lambda () (emmet-mode 1)))


  ;; c and c++
  (defun c_hook ()
    ;; enable irony mode (which I haven't quite learned yet) and automatic curly brackets setting
     (electric-pair-mode 1)
     (irony-mode 1))

  (add-hook 'c++-mode-hook 'c_hook) 
  (add-hook 'c-mode-hook 'c_hook)

  ;; java
  (add-hook 'java-mode-hook (lambda ()
			      (electric-pair-mode 1)))


#+END_SRC

#+RESULTS:
| lambda | nil | (electric-pair-mode 1) |

